Craix/OKDO_E1__PID_DC_Motor/board/pin_mux.h
/*! @name PIO1_2 (number 61), LCD_SCK
  @{ */
#define LCD_SCK_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define LCD_SCK_PIN 2U                   /*!<@brief PORT pin number */
#define LCD_SCK_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name PIO1_26 (number 68), LCD_RST
  @{ */

/* Symbols to be used with GPIO driver */
#define LCD_RST_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define LCD_RST_GPIO_PIN_MASK (1U << 26U) /*!<@brief GPIO pin mask */
#define LCD_RST_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define LCD_RST_PIN 26U                   /*!<@brief PORT pin number */
#define LCD_RST_PIN_MASK (1U << 26U)      /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name PIO1_27 (number 85), LCD_DC
  @{ */

/* Symbols to be used with GPIO driver */
#define LCD_DC_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define LCD_DC_GPIO_PIN_MASK (1U << 27U) /*!<@brief GPIO pin mask */
#define LCD_DC_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define LCD_DC_PIN 27U                   /*!<@brief PORT pin number */
#define LCD_DC_PIN_MASK (1U << 27U)      /*!<@brief PORT pin mask */
                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void LCD(void); /* Function assigned for the Cortex-M33 (Core #0) */

/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_15_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO0_15_FUNC_ALT0 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_15_MODE_INACTIVE 0x00u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_10_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 3. */
#define PIO1_10_FUNC_ALT3 0x03u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO1_10_MODE_INACTIVE 0x00u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_5_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO1_5_FUNC_ALT0 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO1_5_MODE_INACTIVE 0x00u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_8_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO1_8_FUNC_ALT0 0x00u
/*!
 * @brief Selects function mode (on-chip pull-up/pull-down resistor control).: Pull-up. Pull-up resistor enabled. */
#define PIO1_8_MODE_PULL_UP 0x02u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_9_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO1_9_FUNC_ALT0 0x00u
/*!
 * @brief Selects function mode (on-chip pull-up/pull-down resistor control).: Pull-up. Pull-up resistor enabled. */
#define PIO1_9_MODE_PULL_UP 0x02u

/*! @name PIO1_10 (number 40), DC_PWM
  @{ */
#define DC_MOTOR_PWM_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define DC_MOTOR_PWM_PIN 10U                   /*!<@brief PORT pin number */
#define DC_MOTOR_PWM_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PIO1_8 (number 24), DC_DATA
  @{ */

/* Symbols to be used with GPIO driver */
#define DC_MOTOR_DATA_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define DC_MOTOR_DATA_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */
#define DC_MOTOR_DATA_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define DC_MOTOR_DATA_PIN 8U                   /*!<@brief PORT pin number */
#define DC_MOTOR_DATA_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PIO1_9 (number 10), DC_CLK
  @{ */

/* Symbols to be used with GPIO driver */
#define DC_MOTOR_CLK_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define DC_MOTOR_CLK_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */
#define DC_MOTOR_CLK_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define DC_MOTOR_CLK_PIN 9U                   /*!<@brief PORT pin number */
#define DC_MOTOR_CLK_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PIO1_5 (number 31), DC_AIN1
  @{ */

/* Symbols to be used with GPIO driver */
#define DC_MOTOR_AIN2_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define DC_MOTOR_AIN2_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */
#define DC_MOTOR_AIN2_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define DC_MOTOR_AIN2_PIN 5U                   /*!<@brief PORT pin number */
#define DC_MOTOR_AIN2_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PIO0_15 (number 22), DC_AIN2
  @{ */

/* Symbols to be used with GPIO driver */
#define DC_MOTOR_AIN1_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define DC_MOTOR_AIN1_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */
#define DC_MOTOR_AIN1_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define DC_MOTOR_AIN1_PIN 15U                   /*!<@brief PORT pin number */
#define DC_MOTOR_AIN1_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                /* @} */

