Craix/OKDO_E1__PID_DC_Motor/board/pin_mux.h
/*! @name PIO1_9 (number 10), DC_CLK
  @{ */
#define DC_MOTOR_CLK_INT_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define DC_MOTOR_CLK_INT_PIN 9U                   /*!<@brief PORT pin number */
#define DC_MOTOR_CLK_INT_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void DC_MOTOR(void); /* Function assigned for the Cortex-M33 (Core #0) */

/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_31_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO0_31_FUNC_ALT0 0x00u
/*!
 * @brief Selects function mode (on-chip pull-up/pull-down resistor control).: Pull-up. Pull-up resistor enabled. */
#define PIO0_31_MODE_PULL_UP 0x02u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_7_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO0_7_FUNC_ALT0 0x00u
/*!
 * @brief Selects function mode (on-chip pull-up/pull-down resistor control).: Pull-up. Pull-up resistor enabled. */
#define PIO0_7_MODE_PULL_UP 0x02u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_0_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO1_0_FUNC_ALT0 0x00u
/*!
 * @brief Selects function mode (on-chip pull-up/pull-down resistor control).: Pull-up. Pull-up resistor enabled. */
#define PIO1_0_MODE_PULL_UP 0x02u

/*! @name PIO0_7 (number 6), ENC_INC_DATA
  @{ */

/* Symbols to be used with GPIO driver */
#define ENC_INC_DATA_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define ENC_INC_DATA_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */
#define ENC_INC_DATA_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define ENC_INC_DATA_PIN 7U                   /*!<@brief PORT pin number */
#define ENC_INC_DATA_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PIO1_0 (number 11), ENC_INC_CLK
  @{ */

/* Symbols to be used with GPIO driver */
#define ENC_INC_CLK_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define ENC_INC_CLK_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */
#define ENC_INC_CLK_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define ENC_INC_CLK_PIN 0U                   /*!<@brief PORT pin number */
#define ENC_INC_CLK_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PIO0_31 (number 23), ENC_INC_SW
  @{ */

/* Symbols to be used with GPIO driver */
#define ENC_INC_SW_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define ENC_INC_SW_GPIO_PIN_MASK (1U << 31U) /*!<@brief GPIO pin mask */
#define ENC_INC_SW_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define ENC_INC_SW_PIN 31U                   /*!<@brief PORT pin number */
#define ENC_INC_SW_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PIO1_0 (number 11), ENC_INC_CLK
  @{ */
#define ENC_INC_CLK_INT_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define ENC_INC_CLK_INT_PIN 0U                   /*!<@brief PORT pin number */
#define ENC_INC_CLK_INT_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PIO0_31 (number 23), ENC_INC_SW
  @{ */
#define ENC_INC_SW_INT_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define ENC_INC_SW_INT_PIN 31U                   /*!<@brief PORT pin number */
#define ENC_INC_SW_INT_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void ENC_INC(void); /* Function assigned for the Cortex-M33 (Core #0) */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
